Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_glossary_of_immigration_terms_a_checklist.html.txt.tmx
Source language: en
Languages: ga

source: │ │People holding this stamp do not need an employment permit or business permission.│
ga: │ │ │ │ │Is féidir le daoine a bhfuil an stampa seo acu oibriú gan ghá le cead │

source: │ │Can be placed on the foreign passport of an Irish citizen who has dual │
ga: │ │Is féidir é a chur ar phas eachtrannach saoránaigh Éireannaigh a bhfuil │

source: │ │citizenship, and who wants their entitlement to remain in Ireland to be endorsed │
ga: │ │dé-shaoránacht aige/aici, agus ar mian leo go ndéanfaí a dteidlíocht chun │

source: │Stamp number │on their foreign passport
ga: │Stampa uimhir 6│fanacht in Éirinn a fhormhuiniú ar a bpas

source: │ │This stamp certifies that the holder of the passport is permitted to remain in │
ga: │ │Dearbhaíonn an stampa go bhfuil cead ag sealbhóir an phas fanacht in Éirinn gan│

source: │Subsidiary │A status granted under the International Protection Act 2015 to a person who does │
ga: │Cosaint │Stádas a dheonaíodh faoin Acht um Chosaint Idirnáisiúnta 2015 do dhuine nach │

source: │protection │not qualify to be a refugee under the Geneva Convention 1951 but who is at risk of│
ga: │choimhdeach │gcáilíonn mar dhídeanaí ach dá bhfillfeadh sé/sí ar a t(h)ír dhúchais agus go │

source: │ │serious harm if sent home
ga: │ │mbeadh sé/sí thíos le díobháil thromchúiseach

source: │Temporary │A document issued by the International Protection Office to asylum-seekers. It │
ga: │Deimhniú │Doiciméad a eisíonn an Oifig um Chosaint Idirnáisiúnta do iarrthóirí tearmainn.│

source: │residence │contains personal details and a photograph of the person who is seeking asylum
ga: │cónaithe │Bíonn sonraí pearsanta ann agus grianghraf den duine a bhfuil tearmann á lorg │

source: It│ │certificate │is not an identity document
ga: │sealadaigh │aige ann. Ní doiciméad aitheantais é

source: │ │An Irish visa is a certificate stating that the foreign national identified in it │
ga: │ │Is é atá i víosa Éireannach na deimhniú a shonraíonn go dtugann an Rialtas cead│

source: │ │is permitted by the Government to be present at the frontier of the State for the │
ga: │ │don náisiúnach eachtrannach atá aitheanta ann bheith i láthair ag teorainn an │

source: │ │purpose of seeking permission to enter the State
ga: │ │stáit chun críocha cead isteach sa stát a lorg

source: A visa is valid only if affixed │
ga: Ní bhíonn víosa bailí ach má tá│

source: │ │to a passport or travel document
ga: │ │sé ceangailte le pas nó le doiciméad taistil

source: │Visa │The granting of a visa only a form of pre-clearance
ga: │ │ │ │Víosa │Níl i gceist le víosa a bhronnadh ach réamh-imréiteach

source: A visa merely permits a │
ga: Ní thugann an víosa ach│

source: │ │person to travel to the state during the validity period of the visa
ga: │ │cead do dhuine taisteal chuig an Stát le linn na tréimhse ina bhfuil an víosa │

source: │ │does not grant permission to enter or reside in the State
ga: Ní thugann an víosa cead an Stát a iontráil ná cónaí ann

source: │ │given by the immigration officer at the point of entry, who has the authority to │
ga: │ │sin ag an oifigeach inimirce ag an bpointe iontrála, a bhfuil an t-údarás aige │

source: │ │grant or deny such admission
ga: │ │iontráil a bhronnadh nó a dhiúltú

source: Applicants’ passports should be valid for at least 6│
ga: Ba cheart go mbeadh pasanna iarrthóirí bailí│

source: │ │months after the intended date of departure from Ireland following visits
ga: │ │ar feadh 6 mhí ar a laghad tar éis an dáta a bhfuil sé beartaithe imeacht ó │

source: │ │A person who needs a visa if travelling to Ireland
ga: │Náisiúnach nach│Duine nach mór víosa a bheith aige má tá sé ag taisteal go hÉirinn

source: │Visa-required│not require a visa are listed in Schedule 1 of the current Visas Order
ga: │mór víosa a │nach dteastaíonn víosa óna náisiúnaigh liostaithe i Sceideal 1 den Ordú Víosaí │

source: │national │of states can change at any time and a new Order is issued in this case
ga: D'fhéadfadh an liosta stát athrú aon uair agus eisítear Ordú nua ansin.│

source: EEA │ │ │nationals do not require visas
ga: │aici │Ní gá go mbeadh víosaí ag náisiúnaigh LEE

source: There are about 60 other states listed in the │
ga: Tá thart ar 60 stát eile san Ordú │

source: │ │Order, whose nationals do not require a visa
ga: │ │nach gá go mbeadh víosaí ag a náisiúnaigh
